KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSEventReport.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE.CSF</From><MessageID>DE01DE01214420100510120200000001</MessageID><SentAt>2011-08-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSEventReport><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><AadReferenceCode>AadReferenceCode</AadReferenceCode><SequenceNumber>1</SequenceNumber><EventReportMessageType>EventReportMessageType</EventReportMessageType><DateAndTimeOfValidation>2010-04-14T12:12:00+0200</DateAndTimeOfValidation><ExciseCustomsOffice>ExciseCustomsOffice</ExciseCustomsOffice><MemberStateCode>MemberStateCode</MemberStateCode><EventReportNumber>EventReportNumber</EventReportNumber><SubmissionEventReportReference>SubmissionEventReportReference</SubmissionEventReportReference><ChangedTransportArrangement>ChangedTransportArrangement</ChangedTransportArrangement><DateOfEvent>19670813</DateOfEvent><PlaceOfEvent language="DE">V20-PlaceOfEvent</PlaceOfEvent><Comments language="DE">V20-Comments</Comments><IdentificationOfSenderCustomsOfficer>CustomsOfficerID</IdentificationOfSenderCustomsOfficer><SubmittingPerson><SubmittingPersonCode>SubmittingPersonCode</SubmittingPersonCode><SubmittingPersonName>SubmittingPersonName</SubmittingPersonName><SubmittingPersonComplement language="DE">V20-SubmittingPersonComplement</SubmittingPersonComplement></SubmittingPerson><NewTransportArrangerTrader><CustomerID>CustomerID-TA</CustomerID><VATID>VATID-TA</VATID><Address><Name>Name-TA</Name><Street>StreetAndNumber-TA</Street><StreetNumber>1ta</StreetNumber><PostalCode>PostalCode-TA</PostalCode><City>City-TA</City><Language>TA</Language></Address></NewTransportArrangerTrader><NewTransporterTrader><CustomerID>CustomerID-FT</CustomerID><VATID>VATID-FT</VATID><Address><Name>Name-FT</Name><Street>StreetAndNumber-FT</Street><StreetNumber>1ft</StreetNumber><PostalCode>PostalCode-FT</PostalCode><City>City-FT</City><Language>FT</Language></Address></NewTransporterTrader><EvidenceOfEvent><EvidenceTypeCode>EvidenceTypeCode</EvidenceTypeCode><IssuingAuthority language="AA">IssuingAuthority</IssuingAuthority><ReferenceOfEvidence language="AA">ReferenceOfEvidence</ReferenceOfEvidence><EvidenceTypeComplement language="AA">EvidenceTypeComplement</EvidenceTypeComplement></EvidenceOfEvent><EvidenceOfEvent><EvidenceTypeCode>EvidenceTypeCode</EvidenceTypeCode><IssuingAuthority language="AA">IssuingAuthority</IssuingAuthority><ReferenceOfEvidence language="AA">ReferenceOfEvidence</ReferenceOfEvidence><EvidenceTypeComplement language="AA">EvidenceTypeComplement</EvidenceTypeComplement></EvidenceOfEvent><TransportDetails><TransportUnitCode>1</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation</ComplementaryInformation><SealInformation language="AA">SealInformation</SealInformation></TransportDetails><TransportDetails><TransportUnitCode>2</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation</ComplementaryInformation><SealInformation language="AA">SealInformation</SealInformation></TransportDetails><GoodsItem><ItemNumber>1</ItemNumber><EventTypeCode>EventTypeCode</EventTypeCode><IndicatorOfShortageOrExcess>IndicatorOfShortageOrExcess</IndicatorOfShortageOrExcess><ObservedShortageOrExcess>ObservedShortageOrExcess</ObservedShortageOrExcess><AssociatedInformation language="AA">AssociatedInformation</AssociatedInformation></GoodsItem><GoodsItem><ItemNumber>2</ItemNumber><EventTypeCode>EventTypeCode</EventTypeCode><IndicatorOfShortageOrExcess>IndicatorOfShortageOrExcess</IndicatorOfShortageOrExcess><ObservedShortageOrExcess>ObservedShortageOrExcess</ObservedShortageOrExcess><AssociatedInformation language="AA">AssociatedInformation</AssociatedInformation></GoodsItem></EMCSEventReport></EMCS></Submit></soap:Body></soap:Envelope>
